spec/fixtures/stripe/2025-04-30.basil/webhooks/payment_intent_payment_failed.json

{
  "id": "evt_3RWGX8Q8iJWBZFaM0sGXuIkJ",
  "object": "event",
  "api_version": "2025-04-30.basil",
  "created": 1749040506,
  "data": {
    "object": {
      "id": "pi_3RWGX8Q8iJWBZFaM0ZSHRgfm",
      "object": "payment_intent",
      "amount": 4620,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic_async",
      "client_secret": "pi_3RWGX8Q8iJWBZFaM0ZSHRgfm_secret_yT4NUtiy34Yx2LU7ykhSy5YGq",
      "confirmation_method": "automatic",
      "created": 1749040506,
      "currency": "eur",
      "customer": "cus_SR8o2vcGRkVb6v",
      "description": "Heller, Corwin and DuBuque - Invoice HEL-A764-001-001",
      "last_payment_error": {
        "code": "authentication_required",
        "decline_code": "authentication_not_handled",
        "doc_url": "https://stripe.com/docs/error-codes/authentication-required",
        "message": "This payment required an authentication action to complete, but `error_on_requires_action` was set. When you're ready, you can upgrade your integration to handle actions at https://stripe.com/docs/payments/payment-intents/upgrade-to-handle-actions.",
        "payment_method": {
          "id": "pm_1RWGX7Q8iJWBZFaMLTMvnUDU",
          "object": "payment_method",
          "allow_redisplay": "unspecified",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "DE",
            "display_brand": "visa",
            "exp_month": 6,
            "exp_year": 2026,
            "fingerprint": "Kimrq0v3wE9PFZiL",
            "funding": "credit",
            "generated_from": null,
            "last4": "3184",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1749040505,
          "customer": "cus_SR8o2vcGRkVb6v",
          "livemode": false,
          "metadata": {},
          "type": "card"
        },
        "type": "card_error"
      },
      "latest_charge": "ch_3RWGX8Q8iJWBZFaM0IWum1a6",
      "livemode": false,
      "metadata": {
        "invoice_type": "one_off",
        "lago_customer_id": "2c0f0f00-c378-4915-8ea4-c26304e1968a",
        "lago_payment_id": "051587cf-a31c-4150-a735-ee346392a6cf",
        "lago_payable_type": "Invoice",
        "lago_billing_entity_id": "ef90d428-b463-4667-a70b-962b85f4a764",
        "lago_payable_id": "0dbe1733-571d-4bc4-8c80-565fae583143",
        "invoice_issuing_date": "2025-06-04",
        "lago_invoice_id": "0dbe1733-571d-4bc4-8c80-565fae583143",
        "lago_organization_id": "b1c8abc0-daaa-4faa-a8e2-f9b9a9087def"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_tJcP2KRNCIPE0Y",
    "idempotency_key": "payment-051587cf-a31c-4150-a735-ee346392a6cf"
  },
  "type": "payment_intent.payment_failed"
}
